posts/2019-07-29-writing-a-background-worker-for-cisco-nso-finale.org
#+TITLE: Writing a Python background worker for Cisco NSO - finale
#+SUBTITLE: Or how to efficiently wait for things
#+AUTHOR: Kristian Larsson
#+EMAIL: kristian@spritelink.net
#+DATE: <2019-07-29 Mon 14:00>
#+LANGUAGE: en
#+FILETAGS: NSO
#+OPTIONS: toc:nil num:0 H:4 ^:nil pri:t
#+OPTIONS: html-style:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/org.css"/>

* Writing a Python background worker for Cisco NSO - finale
  Having read through the previous two parts ([[./2019-07-25-writing-a-background-worker-for-cisco-nso.html][1]], [[./2019-07-26-writing-a-background-worker-for-cisco-nso-part-deux.html][2]]) you know we now have an implementation that actually works and behaves, at least in regards to the most important properties, the way we want. In this last part I would like to explain some of the implementation details, in particular how we efficiently wait for events.
  
  All daemons, or computer applications running in the background, typically have a number of things they need to continuously perform. If it's a web server, we need to look for new incoming connections and then perform the relevant HTTP query handling. A naive implementation could repeatedly ask, or /poll/, the socket if there is anything new. If we want to react quickly, then we would have to poll very frequently which in turn means that we will use up a lot of CPU. If there are a lot of requests then this could make sense, in fact many network interface drivers use polling as it is much more efficient than being interrupt based. Polling 1000 times per second means that we will notice anything incoming within a maximum of 1 millisecond and for each poll we can efficiently batch handle all the incoming requests (assuming there are more than 1000 request per second). If there aren't that many incoming requests though, it is probably better finding a pattern where we can sleep and be awoken only when there is a request. This is what interrupts can provide to the CPU. UNIX processes don't have interrupts, instead there are signals which act in a similar way and can interrupt what the program is currently doing. It's often used for stopping the application (KILL signal) or reconfiguring it (HUP signal).
  
  There are good use cases for signals but overall they are not the primary means of driving an application control flow. They are meant as simple inputs to a UNIX process from the /outside/.
  
  Smart people realized many moons ago that we needed ways to efficiently wait for input and this is why we have things like =select()= and =poll()= which can efficiently wait for a file descriptor to become readable.
  
  By /efficiently/, I mean it is able to wait for something to happen without consuming a lot of CPU resources yet is able to immediately wake up and return when something has happened. Not only can =select()= efficiently wait for something to happen on a file descriptor, it can wait on *multiple* file descriptors.
  
  Everything in UNIX is a file, which means that sockets have file descriptors too, so we can /wait/ on a bunch of sockets and multiple files all using the same =select()= call. This is the basis for many of the daemons that exist today.
  
  Now for the background worker in NCS we have multiple events we want to observe and react to:
   - react to NCS package events (redeploy primarily)
   - react to the background worker dying (supervisor style)
   - react to changes of the configuration for our background worker (enabled or not)
   - react to HA events
  
  Are all these sockets or file descriptors that we can wait on with a =select()= call? As it turns out, yes, but it wasn't very obvious from the beginning.
  
  
