2019-07-29-writing-a-background-worker-for-cisco-nso-finale.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://plajjan.github.io/rss.xml"
      title="RSS feed for https://plajjan.github.io/"/>
<title>Writing a Python background worker for Cisco NSO - finale</title>
<meta name="author" content="Kristian Larsson">
<meta name="referrer" content="no-referrer">
<link href= "css/style.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
</head>
<body>
<div id="preamble" class="status">
<div class='header'>
  <a href='/'>Network Automation ramblings by Kristian Larsson</a>
</div>
<nav style='float: right; display: block;'>
<a href='/'>Blog</a>
<a href='/tools.html'>Tools</a>
<a href='/about.html'>About</a>
</nav></div>
<div id="content">
<div class="post-date">29 Jul 2019</div><h1 class="post-title"><a href="2019-07-29-writing-a-background-worker-for-cisco-nso-finale.html">Writing a Python background worker for Cisco NSO - finale</a></h1>

<div id="outline-container-org6ea071a" class="outline-2">
<h2 id="org6ea071a">Writing a Python background worker for Cisco NSO - finale</h2>
<div class="outline-text-2" id="text-org6ea071a">
<p>
Having read through the previous two parts (<a href="./2019-07-25-writing-a-background-worker-for-cisco-nso.html">1</a>, <a href="./2019-07-26-writing-a-background-worker-for-cisco-nso-part-deux.html">2</a>) you know we now have an implementation that actually works and behaves, at least in regards to the most important properties, the way we want. In this last part I would like to explain some of the implementation details, in particular how we efficiently wait for events.
</p>

<p>
All daemons, or computer applications running in the background, typically have a number of things they need to continuously perform. If it's a web server, we need to look for new incoming connections and then perform the relevant HTTP query handling. A naive implementation could repeatedly ask, or <i>poll</i>, the socket if there is anything new. If we want to react quickly, then we would have to poll very frequently which in turn means that we will use up a lot of CPU. If there are a lot of requests then this could make sense, in fact many network interface drivers use polling as it is much more efficient than being interrupt based. Polling 1000 times per second means that we will notice anything incoming within a maximum of 1 millisecond and for each poll we can efficiently batch handle all the incoming requests (assuming there are more than 1000 request per second). If there aren't that many incoming requests though, it is probably better finding a pattern where we can sleep and be awoken only when there is a request. This is what interrupts can provide to the CPU. UNIX processes don't have interrupts, instead there are signals which act in a similar way and can interrupt what the program is currently doing. It's often used for stopping the application (KILL signal) or reconfiguring it (HUP signal).
</p>

<p>
There are good use cases for signals but overall they are not the primary means of driving an application control flow. They are meant as simple inputs to a UNIX process from the <i>outside</i>.
</p>

<p>
Smart people realized many moons ago that we needed ways to efficiently wait for input and this is why we have things like <code>select()</code> and <code>poll()</code> which can efficiently wait for a file descriptor to become readable.
</p>

<p>
By <i>efficiently</i>, I mean it is able to wait for something to happen without consuming a lot of CPU resources yet is able to immediately wake up and return when something has happened. Not only can <code>select()</code> efficiently wait for something to happen on a file descriptor, it can wait on <b>multiple</b> file descriptors.
</p>

<p>
Everything in UNIX is a file, which means that sockets have file descriptors too, so we can <i>wait</i> on a bunch of sockets and multiple files all using the same <code>select()</code> call. This is the basis for many of the daemons that exist today.
</p>

<p>
Now for the background worker in NCS we have multiple events we want to observe and react to:
</p>
<ul class="org-ul">
<li>react to NCS package events (redeploy primarily)</li>
<li>react to the background worker dying (supervisor style)</li>
<li>react to changes of the configuration for our background worker (enabled or not)</li>
<li>react to HA events</li>
</ul>

<p>
Are all these sockets or file descriptors that we can wait on with a <code>select()</code> call? As it turns out, yes, but it wasn't very obvious from the beginning.
</p>
</div>
