posts/2019-07-29-writing-a-background-worker-for-cisco-nso-finale.org
** Thread whispering
   When a package is redeployed or reloaded, NCS will stop the currently running instance by calling the =teardown()= function of each component thread. This is where we then in turn can call the =stop()= function on the various threads or processes we are running. Thus, the interface here for the incoming data is a function but we then have to propagate this information from our function to our main thread. If you remember from the [[./2019-07-25-writing-a-background-worker-for-cisco-nso.html][first part]] we had a silly naive implementation of a background worker that looked like this:
   
   #+BEGIN_SRC python
     # -*- mode: python; python-indent: 4 -*-
     import threading
     import time

     import ncs
     from ncs.application import Service


     class BgWorker(threading.Thread):
         def run(self):
             while True:
                 print("Hello from background worker")
                 time.sleep(1)


     class Main(ncs.application.Application):
         def setup(self):
             self.log.info('Main RUNNING')
             self.bgw = BgWorker()
             self.bgw.start()

         def teardown(self):
             self.log.info('Main FINISHED')
             self.bgw.stop()
   #+END_SRC

   and since it had no way to signal to the threads =run()= function that it should stop, it would never stop. We quickly realized this and improved it to:
   
   #+BEGIN_SRC python
     # -*- mode: python; python-indent: 4 -*-
     import threading
     import time

     import ncs
     from ncs.application import Service


     class BgWorker(threading.Thread):
         def __init__(self):
             threading.Thread.__init__(self)
             self._exit_flag = threading.Event()

         def run(self):
             while not self._exit_flag.wait(timeout=1):
                 print("Hello from background worker")

         def stop(self):
             self._exit_flag.set()
             self.join()


     class Main(ncs.application.Application):
         def setup(self):
             self.log.info('Main RUNNING')
             self.bgw = BgWorker()
             self.bgw.start()

         def teardown(self):
             self.log.info('Main FINISHED')
             self.bgw.stop()
   #+END_SRC
   
   where we use a =threading.Event= as the means to signal into the thread =run()= method that we want it to stop. In =run()= we read the =threading.Event= exit flag in a blocking fashion for a second and then perform our main functionality only to return and wait on the =Event=.
   
   Using =wait()= on that Event means we can only wait for a single thing at a time. That's not good enough - we have multiple things we need to observe. In the main supervisor thread we replaced this with a queue since we can feed things into the queue from multiple publishers. Something like this (this isn't our actual supervisor function, just an example showing how we would wait on a queue instead):
   
   #+BEGIN_SRC python
     # -*- mode: python; python-indent: 4 -*-
     import threading
     import time

     import ncs
     from ncs.application import Service


     class BgWorker(threading.Thread):
         def __init__(self):
             threading.Thread.__init__(self)
             self.q = queue.Queue()

         def run(self):
             while True:
                 print("Hello from background worker")

                 item = self.q.get(timeout=1)
                 try:
                     item = self.q.get(timeout=1)
                 except queue.Empty:
                     continue

                 if item == 'exit':
                     return

         def stop(self):
             self.q.put('exit')
             self.join()


     class Main(ncs.application.Application):
         def setup(self):
             self.log.info('Main RUNNING')
             self.bgw = BgWorker()
             self.bgw.start()

         def teardown(self):
             self.log.info('Main FINISHED')
             self.bgw.stop()
   #+END_SRC
   
   Thus far we have just replaced the =threading.Event= with a =queue.Queue= and unlike the =Event=, which effectively just carries a boolean value, the queue could carry close to anything. We use a simple string value of =exit= to signal the thread that it should stop. Now that we have a queue though, we can put more things on the queue and this is why a queue was picked for the supervisor.
   
   When implementing a thread for monitoring something, the important thing to remember is that the =run()= loop of the thread has to be able to monitor its primary object and be signaled from the =stop()= function using the same method so that it can be efficiently waited upon in the =run()= loop.
   
