2019-07-29-writing-a-background-worker-for-cisco-nso-finale.html

<div id="outline-container-org6f0bf7b" class="outline-3">
<h3 id="org6f0bf7b">CDB configuration changes</h3>
<div class="outline-text-3" id="text-org6f0bf7b">
<p>
CDB subscribers are using a design pattern provided by Cisco and we can't influence it much. Instead we have to integrate with it. With a queue to the supervisor this becomes trivial. The config CDB subscriber simply runs as a separate thread and will take whatever updates it receives on CDB changes and publish them on the queue so the supervisor can react to it.
</p>
</div>
</div>
