posts/2019-07-29-writing-a-background-worker-for-cisco-nso-finale.org
** Monitoring HA events
   HA events come from NSO over the notifications API which we access through a socket from Python. Unlike the CDB subscriber, there is no ready to go class that we can just subclass and get moving with. Instead we have to implement the thread =run()= method ourselves. Efficiently waiting on a socket is easy, as already covered, we can use =select()= for this. However, how can we signal the thread to stop using something that is selectable? I chose to implement a WaitableEvent that sends its data over a pipe, which has a file descriptor and thus is waitable. The code for that looks like this:
   
   #+BEGIN_SRC python
     class WaitableEvent:
         """Provides an abstract object that can be used to resume select loops with
         indefinite waits from another thread or process. This mimics the standard
         threading.Event interface."""
         def __init__(self):
             self._read_fd, self._write_fd = os.pipe()

         def wait(self, timeout=None):
             rfds, _, _ = select.select([self._read_fd], [], [], timeout)
             return self._read_fd in rfds

         def is_set(self):
             return self.wait(0)

         def isSet(self):
             return self.wait(0)

         def clear(self):
             if self.isSet():
                 os.read(self._read_fd, 1)

         def set(self):
             if not self.isSet():
                 os.write(self._write_fd, b'1')

         def fileno(self):
             """Return the FD number of the read side of the pipe, allows this
             object to be used with select.select()
             """
             return self._read_fd

         def __del__(self):
             os.close(self._read_fd)
             os.close(self._write_fd)
   #+END_SRC
   
   and we can use it much the same way as =threading.Event= since it implements the same interface, however, note how the underlying transport is an =os.pipe= and we thus can use that in our =select()= call simply by digging out =self._read_fd=. Also note that I didn't write the code for this myself. After realizing what I needed I searched and the Internet delivered.
   
   Here is the code for the HA event monitor using a =WaitableEvent=:
   
   #+BEGIN_SRC python
     class HaEventListener(threading.Thread):
         """HA Event Listener
         HA events, like HA-mode transitions, are exposed over a notification API.
         We listen on that and forward relevant messages over the queue to the
         supervisor which can act accordingly.

         We use a WaitableEvent rather than a threading.Event since the former
         allows us to wait on it using a select loop. The HA events are received
         over a socket which can also be waited upon using a select loop, thus
         making it possible to wait for the two inputs we have using a single select
         loop.
         """
         def __init__(self, app, q):
             super(HaEventListener, self).__init__()
             self.app = app
             self.log = app.log
             self.q = q
             self.log.info('{} supervisor: init'.format(self))
             self.exit_flag = WaitableEvent()

         def run(self):
             self.app.add_running_thread(self.__class__.__name__ + ' (HA event listener)')

             self.log.info('run() HA event listener')
             from _ncs import events
             mask = events.NOTIF_HA_INFO
             event_socket = socket.socket()
             events.notifications_connect(event_socket, mask, ip='127.0.0.1', port=ncs.PORT)
             while True:
                 rl, _, _ = select.select([self.exit_flag, event_socket], [], [])
                 if self.exit_flag in rl:
                     event_socket.close()
                     return

                 notification = events.read_notification(event_socket)
                 # Can this fail? Could we get a KeyError here? Afraid to catch it
                 # because I don't know what it could mean.
                 ha_notif_type = notification['hnot']['type']

                 if ha_notif_type == events.HA_INFO_IS_MASTER:
                     self.q.put(('ha-master', True))
                 elif ha_notif_type == events.HA_INFO_IS_NONE:
                     self.q.put(('ha-master', False))
                 elif ha_notif_type == events.HA_INFO_SLAVE_INITIALIZED:
                     self.q.put(('ha-master', False))

         def stop(self):
             self.exit_flag.set()
             self.join()
             self.app.del_running_thread(self.__class__.__name__ + ' (HA event listener)')
   #+END_SRC
   
   It selects on the =exit_flag= (which is a =WaitableEvent=) and the event socket itself. The =stop()= method simply sets the =WaitableEvent=. If =exit_flag= is readable it means the thread should exit while if the =event_socket= is readable we have a HA event.
   
   We use multiple threads with different methods so we can efficiently monitor different /classes/ of objects.
   
