posts/2019-07-29-writing-a-background-worker-for-cisco-nso-finale.org
** Child process liveness monitor
   If the process we started to run the background worker function dies for whatever reason, we want to notice this and restart it. How can we efficiently monitor the liveness of a child process?
   
   This was the last thing we wanted to monitor that remained as a half busy poll. The supervisor would wait for things coming in on the supervisor queue for one second, then go and check if the child process was alive only to continue monitoring the queue.
   
   The supervisor =run()= function:
   
   #+BEGIN_SRC python
              def run(self):
                  self.app.add_running_thread(self.name + ' (Supervisor)')

                  while True:
                      should_run = self.config_enabled and (not self.ha_enabled or self.ha_master)

                      if should_run and (self.worker is None or not self.worker.is_alive()):
                          self.log.info("Background worker process should run but is not running, starting")
                          if self.worker is not None:
                              self.worker_stop()
                          self.worker_start()
                      if self.worker is not None and self.worker.is_alive() and not should_run:
                          self.log.info("Background worker process is running but should not run, stopping")
                          self.worker_stop()

                      try:
                          item = self.q.get(timeout=1)
                      except queue.Empty:
                          continue

                      k, v = item
                      if k == 'exit':
                          return
                      elif k == 'enabled':
                          self.config_enabled = v
   #+END_SRC

   This irked me. Waking up once a second to check on the child process doesn't exactly qualify as busy polling - only looping once a second won't increase CPU utilization by much, yet child processes dying should be enough of a rare event that not reacting quicker than 1 second is still good enough. It was a simple and pragmatic solution that was enough for production use. But it irked me.

   I wanted to remove the last /busy/ poll and so I started researching the problem. It turns out that it is possible, through a rather clever hack, to detect when a child process is no longer alive.
   
   *When the write end of a POSIX pipe is in the sole possession of a process and that process dies, the read end becomes readable*

   And so this is exactly what we've implemented.
   - setup a pipe
   - fork child process (actually 'spawn'), passing write end of pipe to child
   - close write end of pipe in parent process
   - wait for read end of pipe to become readable, which only happens when the child process has died

   Since a pipe has a file descriptor we can wait on it using our =select()= loop and this is what we do in the later versions of bgworker.
   
** Hiding things from the bg function
   We want to make it dead simple to use the background process library. Passing in a pipe, and the logging objects that need to be set up, as described in the [[./2019-07-26-writing-a-background-worker-for-cisco-nso-part-deux.html][previous part]], should have to be done by the user of our library. We want to take care of that, but how?
   
   When we start the child process, it doesn't immediately run the user provided function. Instead we have a wrapper function that takes care of these things and then hands over control to the user provided function! Like this:
   
   #+BEGIN_SRC python
     def _bg_wrapper(pipe_unused, log_q, log_config_q, log_level, bg_fun, *bg_fun_args):
         """Internal wrapper for the background worker function.

         Used to set up logging via a QueueHandler in the child process. The other end
         of the queue is observed by a QueueListener in the parent process.
         """
         queue_hdlr = logging.handlers.QueueHandler(log_q)
         root = logging.getLogger()
         root.setLevel(log_level)
         root.addHandler(queue_hdlr)

         # thread to monitor log level changes and reconfigure the root logger level
         log_reconf = LogReconfigurator(log_config_q, root)
         log_reconf.start()

         try:
             bg_fun(*bg_fun_args)
         except Exception as e:
             root.error('Unhandled error in {} - {}: {}'.format(bg_fun.__name__, type(e).__name__, e))
             root.debug(traceback.format_exc())

   #+END_SRC
   
   Note how the first argument, accepting the pipe is unused, but it is enough to receive the write end of the pipe. Then we configure logging etc and implement a big exception handler.
   
