2019-07-29-writing-a-background-worker-for-cisco-nso-finale.html

<div id="outline-container-org94cec29" class="outline-3">
<h3 id="org94cec29">Child process liveness monitor</h3>
<div class="outline-text-3" id="text-org94cec29">
<p>
If the process we started to run the background worker function dies for whatever reason, we want to notice this and restart it. How can we efficiently monitor the liveness of a child process?
</p>

<p>
This was the last thing we wanted to monitor that remained as a half busy poll. The supervisor would wait for things coming in on the supervisor queue for one second, then go and check if the child process was alive only to continue monitoring the queue.
</p>

<p>
The supervisor <code>run()</code> function:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">run</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span><span style="color: #4f97d7;">)</span>:
    <span style="color: #4f97d7; font-weight: bold;">self</span>.app.add_running_thread<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>.name + <span style="color: #2d9574;">' (Supervisor)'</span><span style="color: #4f97d7;">)</span>

    <span style="color: #4f97d7; font-weight: bold;">while</span> <span style="color: #a45bad;">True</span>:
        <span style="color: #7590db;">should_run</span> = <span style="color: #4f97d7; font-weight: bold;">self</span>.config_enabled <span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.ha_enabled <span style="color: #4f97d7; font-weight: bold;">or</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.ha_master<span style="color: #4f97d7;">)</span>

        <span style="color: #4f97d7; font-weight: bold;">if</span> should_run <span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>.worker <span style="color: #4f97d7; font-weight: bold;">is</span> <span style="color: #a45bad;">None</span> <span style="color: #4f97d7; font-weight: bold;">or</span> <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.worker.is_alive<span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span>:
            <span style="color: #4f97d7; font-weight: bold;">self</span>.log.info<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Background worker process should run but is not running, starting"</span><span style="color: #4f97d7;">)</span>
            <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.worker <span style="color: #4f97d7; font-weight: bold;">is</span> <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #a45bad;">None</span>:
                <span style="color: #4f97d7; font-weight: bold;">self</span>.worker_stop<span style="color: #4f97d7;">()</span>
            <span style="color: #4f97d7; font-weight: bold;">self</span>.worker_start<span style="color: #4f97d7;">()</span>
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.worker <span style="color: #4f97d7; font-weight: bold;">is</span> <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #a45bad;">None</span> <span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.worker.is_alive<span style="color: #4f97d7;">()</span> <span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #4f97d7; font-weight: bold;">not</span> should_run:
            <span style="color: #4f97d7; font-weight: bold;">self</span>.log.info<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Background worker process is running but should not run, stopping"</span><span style="color: #4f97d7;">)</span>
            <span style="color: #4f97d7; font-weight: bold;">self</span>.worker_stop<span style="color: #4f97d7;">()</span>

        <span style="color: #4f97d7; font-weight: bold;">try</span>:
            <span style="color: #7590db;">item</span> = <span style="color: #4f97d7; font-weight: bold;">self</span>.q.get<span style="color: #4f97d7;">(</span>timeout=<span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
        <span style="color: #4f97d7; font-weight: bold;">except</span> queue.Empty:
            <span style="color: #4f97d7; font-weight: bold;">continue</span>

        <span style="color: #7590db;">k</span>, <span style="color: #7590db;">v</span> = item
        <span style="color: #4f97d7; font-weight: bold;">if</span> k == <span style="color: #2d9574;">'exit'</span>:
            <span style="color: #4f97d7; font-weight: bold;">return</span>
        <span style="color: #4f97d7; font-weight: bold;">elif</span> k == <span style="color: #2d9574;">'enabled'</span>:
            <span style="color: #4f97d7; font-weight: bold;">self</span>.config_enabled = v
</pre>
</div>

<p>
This irked me. Waking up once a second to check on the child process doesn't exactly qualify as busy polling - only looping once a second won't increase CPU utilization by much, yet child processes dying should be enough of a rare event that not reacting quicker than 1 second is still good enough. It was a simple and pragmatic solution that was enough for production use. But it irked me.
</p>

<p>
I wanted to remove the last <i>busy</i> poll and so I started researching the problem. It turns out that it is possible, through a rather clever hack, to detect when a child process is no longer alive.
</p>

<p>
<b>When the write end of a POSIX pipe is in the sole possession of a process and that process dies, the read end becomes readable</b>
</p>

<p>
And so this is exactly what we've implemented.
</p>
<ul class="org-ul">
<li>setup a pipe</li>
<li>fork child process (actually 'spawn'), passing write end of pipe to child</li>
<li>close write end of pipe in parent process</li>
<li>wait for read end of pipe to become readable, which only happens when the child process has died</li>
</ul>

<p>
Since a pipe has a file descriptor we can wait on it using our <code>select()</code> loop and this is what we do in the later versions of bgworker.
</p>
</div>
</div>

<div id="outline-container-orga6b90b5" class="outline-3">
<h3 id="orga6b90b5">Hiding things from the bg function</h3>
<div class="outline-text-3" id="text-orga6b90b5">
<p>
We want to make it dead simple to use the background process framework. Passing in a pipe, and the logging objects that need to be set up, as described in the <a href="./2019-07-26-writing-a-background-worker-for-cisco-nso-part-deux.html">previous part</a>, should have to be done by the user of our framework. We want to take care of that, but how?
</p>

<p>
When we start the child process, it doesn't immediately run the user provided function. Instead we have a wrapper function that takes care of these things and then hands over control to the user provided function! Like this:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">_bg_wrapper</span><span style="color: #4f97d7;">(</span>pipe_unused, log_q, log_config_q, log_level, bg_fun, *bg_fun_args<span style="color: #4f97d7;">)</span>:
    <span style="color: #9f8766;">"""Internal wrapper for the background worker function.</span>

<span style="color: #9f8766;">    Used to set up logging via a QueueHandler in the child process. The other end</span>
<span style="color: #9f8766;">    of the queue is observed by a QueueListener in the parent process.</span>
<span style="color: #9f8766;">    """</span>
    <span style="color: #7590db;">queue_hdlr</span> = logging.handlers.QueueHandler<span style="color: #4f97d7;">(</span>log_q<span style="color: #4f97d7;">)</span>
    <span style="color: #7590db;">root</span> = logging.getLogger<span style="color: #4f97d7;">()</span>
    root.setLevel<span style="color: #4f97d7;">(</span>log_level<span style="color: #4f97d7;">)</span>
    root.addHandler<span style="color: #4f97d7;">(</span>queue_hdlr<span style="color: #4f97d7;">)</span>

    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">thread to monitor log level changes and reconfigure the root logger level</span>
    <span style="color: #7590db;">log_reconf</span> = LogReconfigurator<span style="color: #4f97d7;">(</span>log_config_q, root<span style="color: #4f97d7;">)</span>
    log_reconf.start<span style="color: #4f97d7;">()</span>

    <span style="color: #4f97d7; font-weight: bold;">try</span>:
        bg_fun<span style="color: #4f97d7;">(</span>*bg_fun_args<span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">except</span> <span style="color: #ce537a; font-weight: bold;">Exception</span> <span style="color: #4f97d7; font-weight: bold;">as</span> e:
        root.error<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'Unhandled error in {} - {}: {}'</span>.<span style="color: #4f97d7;">format</span><span style="color: #bc6ec5;">(</span>bg_fun.<span style="color: #4f97d7;">__name__</span>, <span style="color: #4f97d7;">type</span><span style="color: #2d9574;">(</span>e<span style="color: #2d9574;">)</span>.<span style="color: #4f97d7;">__name__</span>, e<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
        root.debug<span style="color: #4f97d7;">(</span>traceback.format_exc<span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span>

</pre>
</div>

<p>
Note how the first argument, accepting the pipe is unused, but it is enough to receive the write end of the pipe. Then we configure logging etc and implement a big exception handler.
</p>
</div>
</div>
