posts/2019-07-29-writing-a-background-worker-for-cisco-nso-finale.org
** A selectable queue
   Monitoring the child process liveness happens through a pipe which is waitable using select. As previously described though, we placed a queue at the center of the supervisor thread and send messages from other threads over this queue. Now we have a queue and a pipe to wait on, how?
   
   We could probably abandon the queue and have those messages be sent over a pipe, which we could then =select()= on... but the queue is so convenient!
   
   The =multiprocessing= library also has a queue which works across multiple processes. It uses a pipe under the hood to pass the messages and deals with things like sharing the the file descriptor when you spawn your child process (which is what we do). By simply switching from =queue.Queue= to =multiprocessing.Queue= (they feature the exact same interface) we have gained a pipe under the hood that we can =select()= on. Voilà!
   
   Here's the code for the supervisor thread showing both the selectable queue (well, pipe) and the clever child process liveness monitor. To read the full up to date code for the whole background process library, just head over to [[https://github.com/plajjan/bgworker/][the bgworker repo on Github]].

   #+BEGIN_SRC python
     class Process(threading.Thread):
         """Supervisor for running the main background process and reacting to
         various events
         """
         def __init__(self, app, bg_fun, bg_fun_args=None, config_path=None):
             super(Process, self).__init__()
             self.app = app
             self.bg_fun = bg_fun
             if bg_fun_args is None:
                 bg_fun_args = []
             self.bg_fun_args = bg_fun_args
             self.config_path = config_path
             self.parent_pipe = None

             self.log = app.log
             self.name = "{}.{}".format(self.app.__class__.__module__,
                                        self.app.__class__.__name__)
             self.log.info("{} supervisor starting".format(self.name))

             self.vmid = self.app._ncs_id

             self.mp_ctx = multiprocessing.get_context('spawn')
             self.q = self.mp_ctx.Queue()

             # start the config subscriber thread
             if self.config_path is not None:
                 self.config_subscriber = Subscriber(app=self.app, log=self.log)
                 subscriber_iter = ConfigSubscriber(self.q, self.config_path)
                 subscriber_iter.register(self.config_subscriber)
                 self.config_subscriber.start()

             # start the HA event listener thread
             self.ha_event_listener = HaEventListener(app=self.app, q=self.q)
             self.ha_event_listener.start()

             # start the logging QueueListener thread
             hdlrs = list(_get_handler_impls(self.app._logger))
             self.log_queue = self.mp_ctx.Queue()
             self.queue_listener = logging.handlers.QueueListener(self.log_queue, *hdlrs, respect_handler_level=True)
             self.queue_listener.start()
             self.current_log_level = self.app._logger.getEffectiveLevel()

             # start log config CDB subscriber
             self.log_config_q = self.mp_ctx.Queue()
             self.log_config_subscriber = Subscriber(app=self.app, log=self.log)
             log_subscriber_iter = LogConfigSubscriber(self.log_config_q, self.vmid)
             log_subscriber_iter.register(self.log_config_subscriber)
             self.log_config_subscriber.start()

             self.worker = None

             # Read initial configuration, using two separate transactions
             with ncs.maapi.Maapi() as m:
                 with ncs.maapi.Session(m, '{}_supervisor'.format(self.name), 'system'):
                     # in the 1st transaction read config data from the 'enabled' leaf
                     with m.start_read_trans() as t_read:
                         if config_path is not None:
                             enabled = t_read.get_elem(self.config_path)
                             self.config_enabled = bool(enabled)
                         else:
                             # if there is no config_path we assume the process is always enabled
                             self.config_enabled = True

                     # In the 2nd transaction read operational data regarding HA.
                     # This is an expensive operation invoking a data provider, thus
                     # we don't want to incur any unnecessary locks
                     with m.start_read_trans(db=ncs.OPERATIONAL) as oper_t_read:
                         # check if HA is enabled
                         if oper_t_read.exists("/tfnm:ncs-state/tfnm:ha"):
                             self.ha_enabled = True
                         else:
                             self.ha_enabled = False

                         # determine HA state if HA is enabled
                         if self.ha_enabled:
                             ha_mode = str(ncs.maagic.get_node(oper_t_read, '/tfnm:ncs-state/tfnm:ha/tfnm:mode'))
                             self.ha_master = (ha_mode == 'master')


         def run(self):
             self.app.add_running_thread(self.name + ' (Supervisor)')

             while True:
                 try:
                     should_run = self.config_enabled and (not self.ha_enabled or self.ha_master)

                     if should_run and (self.worker is None or not self.worker.is_alive()):
                         self.log.info("Background worker process should run but is not running, starting")
                         if self.worker is not None:
                             self.worker_stop()
                         self.worker_start()
                     if self.worker is not None and self.worker.is_alive() and not should_run:
                         self.log.info("Background worker process is running but should not run, stopping")
                         self.worker_stop()

                     # check for input
                     waitable_rfds = [self.q._reader]
                     if should_run:
                         waitable_rfds.append(self.parent_pipe)

                     rfds, _, _ = select.select(waitable_rfds, [], [])
                     for rfd in rfds:
                         if rfd == self.q._reader:
                             k, v = self.q.get()

                             if k == 'exit':
                                 return
                             elif k == 'enabled':
                                 self.config_enabled = v
                             elif k == "ha-master":
                                 self.ha_master = v

                         if rfd == self.parent_pipe:
                             # getting a readable event on the pipe should mean the
                             # child is dead - wait for it to die and start again
                             # we'll restart it at the top of the loop
                             self.log.info("Child process died")
                             if self.worker.is_alive():
                                 self.worker.join()

                 except Exception as e:
                     self.log.error('Unhandled exception in the supervisor thread: {} ({})'.format(type(e).__name__, e))
                     self.log.debug(traceback.format_exc())
                     time.sleep(1)


         def stop(self):
             """stop is called when the supervisor thread should stop and is part of
             the standard Python interface for threading.Thread
             """
             # stop the HA event listener
             self.log.debug("{}: stopping HA event listener".format(self.name))
             self.ha_event_listener.stop()

             # stop config CDB subscriber
             self.log.debug("{}: stopping config CDB subscriber".format(self.name))
             if self.config_path is not None:
                 self.config_subscriber.stop()

             # stop log config CDB subscriber
             self.log.debug("{}: stopping log config CDB subscriber".format(self.name))
             self.log_config_subscriber.stop()

             # stop the logging QueueListener
             self.log.debug("{}: stopping logging QueueListener".format(self.name))
             self.queue_listener.stop()

             # stop us, the supervisor
             self.log.debug("{}: stopping supervisor thread".format(self.name))

             self.q.put(('exit', None))
             self.join()
             self.app.del_running_thread(self.name + ' (Supervisor)')

             # stop the background worker process
             self.log.debug("{}: stopping background worker process".format(self.name))
             self.worker_stop()


         def worker_start(self):
             """Starts the background worker process
             """
             self.log.info("{}: starting the background worker process".format(self.name))
             # Instead of using the usual worker thread, we use a separate process here.
             # This allows us to terminate the process on package reload / NSO shutdown.

             # using multiprocessing.Pipe which is shareable across a spawned
             # process, while os.pipe only works, per default over to a forked
             # child
             self.parent_pipe, child_pipe = self.mp_ctx.Pipe()

             # Instead of calling the bg_fun worker function directly, call our
             # internal wrapper to set up things like inter-process logging through
             # a queue.
             args = [child_pipe, self.log_queue, self.log_config_q, self.current_log_level, self.bg_fun] + self.bg_fun_args
             self.worker = self.mp_ctx.Process(target=_bg_wrapper, args=args)
             self.worker.start()

             # close child pipe in parent so only child is in possession of file
             # handle, which means we get EOF when the child dies
             child_pipe.close()


         def worker_stop(self):
             """Stops the background worker process
             """
             if self.worker is None:
                 self.log.info("{}: asked to stop worker but background worker does not exist".format(self.name))
                 return
             if self.worker.is_alive():
                 self.log.info("{}: stopping the background worker process".format(self.name))
                 self.worker.terminate()
             self.worker.join(timeout=1)
             if self.worker.is_alive():
                 self.log.error("{}: worker not terminated on time, alive: {}  process: {}".format(self, self.worker.is_alive(), self.worker))
   #+END_SRC
   
