2019-07-29-writing-a-background-worker-for-cisco-nso-finale.html

<div id="outline-container-orgc4aeec6" class="outline-3">
<h3 id="orgc4aeec6">Finale</h3>
<div class="outline-text-3" id="text-orgc4aeec6">
<p>
And with that, we conclude the interesting parts of how to implement a background worker for Cisco NSO. I hope you've found it interesting to read about. It was fun and interesting implementing, in particular as it's been a while for me since I was this deep into the low level workings of things. I am a staunch believer that we generally need to use frameworks/libraries when implementing network automation or other application/business logic so we can focus on the right set of the problems rather than interweaving say the low level details of POSIX processes with our application logic. In essence; using the right abstraction layers. Our human brains can only focus on so many things at a time and using the right abstractions is therefore crucial. Most of the time I mostly deal with high level languages touching high level things - exactly as I want it to be. However, once in a while, when the framework (NSO in this case) doesn't provide what you need (a way to run background workers), you just have to do it yourself.
</p>

<p>
I hope you will also appreciate the amount of energy that went into writing the bgworker package. It is a rewrite of the common set of core functionality of the background workers we already had, resulting in a much better and cleaner implementation using a generic framework/library style interface allowing anyone to use it. If you have the need for running background workers in NSO I strongly recommend that you make use of it. There's a lot of lessons learned here and starting over from scratch with a naive implementation means you will learn all of them the hard way. If bgworker doesn't fit in your architecture then feel free to give feedback and perhaps we can find a way forward together.
</p>
</div>
</div>
</div>
<div class="taglist"><a href="tags.html">Tags</a>: <a href="tag-nso.html">NSO</a> </div></div>
<div id="postamble" class="status"><br/><div id="archive">
  <a href="/archive.html">Other posts</a>
</div></div>
</body>
</html>
